__missing data__

how to deal with any missing data in input. pandas puts a null or given value in missing datapoints

In [1]:
import numpy as np
import pandas as pd

In [3]:
#creating a dictonary 
d={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [4]:
#creating a dataframe off the dict
df=pd.DataFrame(d)

In [5]:
#no missing values in row 0 and column C
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

null values can be dropped by dropna() method as below

In [7]:
#it dropped any row that has missing values here row 1 and 2
df.dropna()

     A    B  C
0  1.0  5.0  1

In [8]:
#to drop column axis should be 1 here column A abd B are dropped as they have missing values
df.dropna(axis=1)

   C
0  1
1  2
2  3

dropping can be controlled by thresh arg of dropna see help for that.

In [9]:
#thresh->requires that many na values. 
df.dropna(thresh=2) #if any row(since axis is 0 def) has 2 na values dnt drop it

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

here row 1 was not dropped cuz it had 2 na values that we passed as thresh in dropna

In [11]:
#for column  do as below
df.dropna(thresh=2,axis=1)

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

column A was not dropped as it has two na values

now another thing we can do is fill in the missing values with fillna() method as below

In [10]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [12]:
df.fillna(value='fill')

      A     B  C
0     1     5  1
1     2  fill  2
2  fill  fill  3

so 'fill' is inserted in each missing value

we can also fill statistical values such as mean mode and others depending on what type of data we are dealing with. lets fill mean below

In [15]:
#in column 'A' we fill mean value
df['A'].fillna(value=np.mean(df['A']))

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

so mean value is inserted in row2 columnA